app/controllers/cart_controller.rb

SELECT "line_items".* FROM "line_items"
---
  def view_order
 @line_items = LineItem.all