app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT "items".* FROM "items"

  def new
    @item = Item.new
      @jewelrygroups = Jewelrygroup.all
      @jewelrycategories = Jewelrycategory.all
      @jewelrycollections = Jewelrycollection.all
      @jewelrymetals = Jewelrymetal.all
---
SELECT "jewelrygroups".* FROM "jewelrygroups"
SELECT "jewelrycategories".* FROM "jewelrycategories"
SELECT "jewelrycollections".* FROM "jewelrycollections"
SELECT "jewelrymetals".* FROM "jewelrymetals"