app/controllers/store_front_controller.rb

  def catalog
      @items= Item.all
---
SELECT "items".* FROM "items"